mcuxrandall/2.04-Integration/Individual_Test_Projects/MCXN947_TXST_Peripheral_Integration/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Enables the clock for GPIO0: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    /* Enables the clock for GPIO1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio1);
    /* Enables the clock for GPIO2: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio2);
    /* Enables the clock for GPIO4: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio4);
    /* Enables the clock for PORT0 controller: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port0);
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);
    /* Enables the clock for PORT2: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port2);
    /* Enables the clock for PORT3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port3);
    /* Enables the clock for PORT4: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port4);

    gpio_pin_config_t Switch_1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin E11)  */
    GPIO_PinInit(BOARD_INITPINS_Switch_1_GPIO, BOARD_INITPINS_Switch_1_PIN, &Switch_1_config);

    gpio_pin_config_t Button_1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_15 (pin G13)  */
    GPIO_PinInit(BOARD_INITPINS_Button_1_GPIO, BOARD_INITPINS_Button_1_PIN, &Button_1_config);

    gpio_pin_config_t Switch_2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_22 (pin B8)  */
    GPIO_PinInit(BOARD_INITPINS_Switch_2_GPIO, BOARD_INITPINS_Switch_2_PIN, &Switch_2_config);

    gpio_pin_config_t LED_0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_30 (pin E7)  */
    GPIO_PinInit(BOARD_INITPINS_LED_0_GPIO, BOARD_INITPINS_LED_0_PIN, &LED_0_config);

    gpio_pin_config_t Motor_BIN2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_22 (pin L4)  */
    GPIO_PinInit(BOARD_INITPINS_Motor_BIN2_GPIO, BOARD_INITPINS_Motor_BIN2_PIN, &Motor_BIN2_config);

    gpio_pin_config_t LED_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_23 (pin M4)  */
    GPIO_PinInit(BOARD_INITPINS_LED_2_GPIO, BOARD_INITPINS_LED_2_PIN, &LED_2_config);

    gpio_pin_config_t Motor_STANDBY_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_0 (pin H2)  */
    GPIO_PinInit(BOARD_INITPINS_Motor_STANDBY_GPIO, BOARD_INITPINS_Motor_STANDBY_PIN, &Motor_STANDBY_config);

    gpio_pin_config_t Motor_BIN1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_3 (pin J3)  */
    GPIO_PinInit(BOARD_INITPINS_Motor_BIN1_GPIO, BOARD_INITPINS_Motor_BIN1_PIN, &Motor_BIN1_config);

    gpio_pin_config_t Motor_AIN1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_6 (pin K2)  */
    GPIO_PinInit(BOARD_INITPINS_Motor_AIN1_GPIO, BOARD_INITPINS_Motor_AIN1_PIN, &Motor_AIN1_config);

    gpio_pin_config_t Motor_AIN2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_7 (pin L2)  */
    GPIO_PinInit(BOARD_INITPINS_Motor_AIN2_GPIO, BOARD_INITPINS_Motor_AIN2_PIN, &Motor_AIN2_config);

    gpio_pin_config_t LED_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_16 (pin R8)  */
    GPIO_PinInit(BOARD_INITPINS_LED_1_GPIO, BOARD_INITPINS_LED_1_PIN, &LED_1_config);

    gpio_pin_config_t Button_0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_20 (pin T10)  */
    GPIO_PinInit(BOARD_INITPINS_Button_0_GPIO, BOARD_INITPINS_Button_0_PIN, &Button_0_config);

    const port_pin_config_t port0_10_pinB12_config = {/* Internal pull-up/down resistor is disabled */
                                                      .pullSelect = kPORT_PullDisable,
                                                      /* Low internal pull resistor value is selected. */
                                                      .pullValueSelect = kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      .slewRate = kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      .openDrainEnable = kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      .driveStrength = kPORT_LowDriveStrength,
                                                      /* Pin is configured as PIO0_10 */
                                                      .mux = kPORT_MuxAlt0,
                                                      /* Digital input enabled */
                                                      .inputBuffer = kPORT_InputBufferEnable,
                                                      /* Digital input is not inverted */
                                                      .invertInput = kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      .lockRegister = kPORT_UnlockRegister};
    /* PORT0_10 (pin B12) is configured as PIO0_10 */
    PORT_SetPinConfig(PORT0, 10U, &port0_10_pinB12_config);

    /* PORT0_14 (pin E11) is configured as PIO0_14 */
    PORT_SetPinMux(BOARD_INITPINS_Switch_1_PORT, BOARD_INITPINS_Switch_1_PIN, kPORT_MuxAlt0);

    PORT0->PCR[14] = ((PORT0->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_15 (pin G13) is configured as PIO0_15 */
    PORT_SetPinMux(BOARD_INITPINS_Button_1_PORT, BOARD_INITPINS_Button_1_PIN, kPORT_MuxAlt0);

    PORT0->PCR[15] = ((PORT0->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    const port_pin_config_t DEBUG_SWD_SWO = {/* Internal pull-up/down resistor is disabled */
                                             .pullSelect = kPORT_PullDisable,
                                             /* Low internal pull resistor value is selected. */
                                             .pullValueSelect = kPORT_LowPullResistor,
                                             /* Fast slew rate is configured */
                                             .slewRate = kPORT_FastSlewRate,
                                             /* Passive input filter is disabled */
                                             .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                             /* Open drain output is disabled */
                                             .openDrainEnable = kPORT_OpenDrainDisable,
                                             /* High drive strength is configured */
                                             .driveStrength = kPORT_HighDriveStrength,
                                             /* Pin is configured as SWO */
                                             .mux = kPORT_MuxAlt1,
                                             /* Digital input enabled */
                                             .inputBuffer = kPORT_InputBufferEnable,
                                             /* Digital input is not inverted */
                                             .invertInput = kPORT_InputNormal,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             .lockRegister = kPORT_UnlockRegister};
    /* PORT0_2 (pin B16) is configured as SWO */
    PORT_SetPinConfig(BOARD_INITPINS_DEBUG_SWD_SWO_PORT, BOARD_INITPINS_DEBUG_SWD_SWO_PIN, &DEBUG_SWD_SWO);

    /* PORT0_22 (pin B8) is configured as PIO0_22 */
    PORT_SetPinMux(BOARD_INITPINS_Switch_2_PORT, BOARD_INITPINS_Switch_2_PIN, kPORT_MuxAlt0);

    PORT0->PCR[22] = ((PORT0->PCR[22] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

