mcuxrandall/2.04-Integration/Individual_Test_Projects/MCXN947_TXST_Peripheral_Integration/board/pin_mux.c
    /* PORT0_24 (pin B6) is configured as CT0_MAT0 */
    PORT_SetPinMux(BOARD_INITPINS_PWMA_PORT, BOARD_INITPINS_PWMA_PIN, kPORT_MuxAlt4);

    PORT0->PCR[24] = ((PORT0->PCR[24] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK)))

                      /* Drive Strength Enable: Low. */
                      | PORT_PCR_DSE(PCR_DSE_dse0)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_26 (pin F10) is configured as CT0_MAT2 */
    PORT_SetPinMux(BOARD_INITPINS_PWMB_PORT, BOARD_INITPINS_PWMB_PIN, kPORT_MuxAlt4);

    PORT0->PCR[26] = ((PORT0->PCR[26] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_30 (pin E7) is configured as PIO0_30 */
    PORT_SetPinMux(BOARD_INITPINS_LED_0_PORT, BOARD_INITPINS_LED_0_PIN, kPORT_MuxAlt0);

    PORT0->PCR[30] = ((PORT0->PCR[30] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_22 (pin L4) is configured as PIO1_22 */
    PORT_SetPinMux(BOARD_INITPINS_Motor_BIN2_PORT, BOARD_INITPINS_Motor_BIN2_PIN, kPORT_MuxAlt0);

    PORT1->PCR[22] = ((PORT1->PCR[22] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK)))

                      /* Drive Strength Enable: High. */
                      | PORT_PCR_DSE(PCR_DSE_dse1)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_23 (pin M4) is configured as PIO1_23 */
    PORT_SetPinMux(BOARD_INITPINS_LED_2_PORT, BOARD_INITPINS_LED_2_PIN, kPORT_MuxAlt0);

    PORT1->PCR[23] = ((PORT1->PCR[23] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_0 (pin H2) is configured as PIO2_0 */
    PORT_SetPinMux(BOARD_INITPINS_Motor_STANDBY_PORT, BOARD_INITPINS_Motor_STANDBY_PIN, kPORT_MuxAlt0);

    PORT2->PCR[0] = ((PORT2->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_2 (pin H3) is configured as PWM1_A2 */
    PORT_SetPinMux(BOARD_INITPINS_RGB_A2_PWM_PORT, BOARD_INITPINS_RGB_A2_PWM_PIN, kPORT_MuxAlt5);

    PORT2->PCR[2] = ((PORT2->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_3 (pin J3) is configured as PIO2_3 */
    PORT_SetPinMux(BOARD_INITPINS_Motor_BIN1_PORT, BOARD_INITPINS_Motor_BIN1_PIN, kPORT_MuxAlt0);

    PORT2->PCR[3] = ((PORT2->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK)))

                     /* Drive Strength Enable: High. */
                     | PORT_PCR_DSE(PCR_DSE_dse1)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_4 (pin K3) is configured as PWM1_A1 */
    PORT_SetPinMux(BOARD_INITPINS_RGB_A1_PWM_PORT, BOARD_INITPINS_RGB_A1_PWM_PIN, kPORT_MuxAlt5);

    PORT2->PCR[4] = ((PORT2->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_5 (pin K1) is configured as PWM1_B1 */
    PORT_SetPinMux(BOARD_INITPINS_RGB_B1_PWM_PORT, BOARD_INITPINS_RGB_B1_PWM_PIN, kPORT_MuxAlt5);

    PORT2->PCR[5] = ((PORT2->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_6 (pin K2) is configured as PIO2_6 */
    PORT_SetPinMux(BOARD_INITPINS_Motor_AIN1_PORT, BOARD_INITPINS_Motor_AIN1_PIN, kPORT_MuxAlt0);

    PORT2->PCR[6] = ((PORT2->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK)))

                     /* Drive Strength Enable: High. */
                     | PORT_PCR_DSE(PCR_DSE_dse1)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_7 (pin L2) is configured as PIO2_7 */
    PORT_SetPinMux(BOARD_INITPINS_Motor_AIN2_PORT, BOARD_INITPINS_Motor_AIN2_PIN, kPORT_MuxAlt0);

    PORT2->PCR[7] = ((PORT2->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK)))

                     /* Drive Strength Enable: High. */
                     | PORT_PCR_DSE(PCR_DSE_dse1)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_20 (pin M17) is configured as FC6_P0 */
    PORT_SetPinMux(BOARD_INITPINS_microSD_MOSI_PORT, BOARD_INITPINS_microSD_MOSI_PIN, kPORT_MuxAlt3);

    PORT3->PCR[20] = ((PORT3->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_21 (pin L16) is configured as FC6_P1 */
    PORT_SetPinMux(BOARD_INITPINS_microSD_CLK_PORT, BOARD_INITPINS_microSD_CLK_PIN, kPORT_MuxAlt3);

    PORT3->PCR[21] = ((PORT3->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

